# Задание 3:
    # Вам дан SET значений:
    # uniques = {3,13,15,27,1,4,8,23,19,12,9,2,17}
    # Создайте функцию которая:
        # Удалит все чётные значения внутри SET, а оставшиеся отсортирует по убыванию.
    # В результате, ваша функция должна вернуть отсортированный SET и неважно, каким будет SET растопленным или замороженным.



uniques = {3,13,15,27,1,4,8,23,19,12,9,2,17}

if uniques %2 == 0:
    print(uniques)





