# products = {
#    'утюг': 3500,
#    'телевизов': 24000,
#    'стиральная_машина': 30000,
#    'фен': 5500
# }



# a = products['утюг'] + products['телевизов'] + products['стиральная_машина']+products['фен']
# print(a)

# s = a * 0.85
# print('u need only: ',s, 'dollars')



#---------------------------------------------------------------------------------




# a = input('Введите число: ')
# g = int(a[0])
# b = int(a[1])
# c = int(a[2])


# print("Сумма цифр числа:", g + b + c)


#-------------------------------------------------------------



# a = input("Введите число: ")
# b = a[::-1]
# print(b)
